Hi @huerlisi, I'm not able to reproduce the issue you're reporting (if I understood correctly):

```hcl
# test.tf
terraform {
  required_providers {
    exoscale = {
      source  = "exoscale/exoscale"
      version = "0.18.2"
    }
  }
}

locals {
  zone = "ch-gva-2"
}

resource "exoscale_security_group" "test" {
  name = "test"
}

resource "exoscale_security_group_rules" "admin" {
  security_group = exoscale_security_group.test.name

  ingress {
    protocol  = "ICMP"
    icmp_type = 8
    cidr_list = ["1.2.3.4/32"]
  }

  ingress {
    protocol  = "TCP"
    ports     = ["22"]
    cidr_list = ["1.2.3.4/32"]
  }
}

resource "exoscale_security_group_rules" "web" {
  security_group_id = exoscale_security_group.test.id

  ingress {
    protocol  = "TCP"
    ports     = ["80", "443"]
    cidr_list = ["0.0.0.0/0", "::/0"]
  }
}
```

```console
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # exoscale_security_group.test will be created
  + resource "exoscale_security_group" "test" {
      + id   = (known after apply)
      + name = "test"
    }

  # exoscale_security_group_rules.admin will be created
  + resource "exoscale_security_group_rules" "admin" {
      + id                = (known after apply)
      + security_group    = "test"
      + security_group_id = (known after apply)

      + ingress {
          + cidr_list                = [
              + "1.2.3.4/32",
            ]
          + icmp_type                = 8
          + ids                      = (known after apply)
          + ports                    = []
          + protocol                 = "ICMP"
          + user_security_group_list = []
        }
      + ingress {
          + cidr_list                = [
              + "1.2.3.4/32",
            ]
          + ids                      = (known after apply)
          + ports                    = [
              + "22",
            ]
          + protocol                 = "TCP"
          + user_security_group_list = []
        }
    }

  # exoscale_security_group_rules.web will be created
  + resource "exoscale_security_group_rules" "web" {
      + id                = (known after apply)
      + security_group    = (known after apply)
      + security_group_id = (known after apply)

      + ingress {
          + cidr_list                = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + ids                      = (known after apply)
          + ports                    = [
              + "443",
              + "80",
            ]
          + protocol                 = "TCP"
          + user_security_group_list = []
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

exoscale_security_group.test: Creating...
exoscale_security_group.test: Creation complete after 1s [id=6df33ca2-0102-4f0b-868c-278bcb4818a7]
exoscale_security_group_rules.web: Creating...
exoscale_security_group_rules.admin: Creating...
exoscale_security_group_rules.admin: Creation complete after 10s [id=11199607447739267382]
exoscale_security_group_rules.web: Still creating... [10s elapsed]
exoscale_security_group_rules.web: Creation complete after 19s [id=11926759511765359899]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

exoscale_security_group.test: Refreshing state... [id=6df33ca2-0102-4f0b-868c-278bcb4818a7]
exoscale_security_group_rules.web: Refreshing state... [id=11926759511765359899]
exoscale_security_group_rules.admin: Refreshing state... [id=11199607447739267382]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

exoscale_security_group.test: Refreshing state... [id=6df33ca2-0102-4f0b-868c-278bcb4818a7]
exoscale_security_group_rules.web: Refreshing state... [id=11926759511765359899]
exoscale_security_group_rules.admin: Refreshing state... [id=11199607447739267382]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
```

Can you please share your actual configuration so we can try to reproduce your issue?